---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnTopExtension
source: html/5b761477-a851-2662-8d78-c4ba3909b3de.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnTopExtension Property

"Top x Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelColumnTopExtension { get; }
```